STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRateFreeRTOS_ANCS/STM32_WPAN/App/app_ble.c
      case ACI_GAP_SLAVE_SECURITY_INITIATED_VSEVT_CODE: 
        APP_DBG_MSG("ACI_GAP_SLAVE_SECURITY_INITIATED_VSEVT_CODE slave security request is successfully sent to the master \n");
        //gap_cmd_resp_release(0);
          break; /* ACI_GAP_SLAVE_SECURITY_INITIATED_VSEVT_CODE */

      case ACI_GAP_BOND_LOST_VSEVT_CODE:    

        APP_DBG_MSG("ACI_GAP_BOND_LOST_VSEVT_CODE ==> GAP_PROC_ALLOW_REBOND \n\r");
        GapProcReq(GAP_PROC_ALLOW_REBOND);

          break; /* ACI_GAP_BOND_LOST_VSEVT_CODE */

      case ACI_GAP_ADDR_NOT_RESOLVED_VSEVT_CODE:
         APP_DBG_MSG("\r\n\r** ACI_GAP_ADDR_NOT_RESOLVED_VSEVT_CODE \n");
          break; /* ACI_GAP_ADDR_NOT_RESOLVED_VSEVT_CODE */
      
      case (ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE):
         APP_DBG_MSG("\r\n\r** ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE\n");
          break; /* ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE */    

      case (ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE):
        APP_DBG_MSG(" numeric_value = %ld\n", ((aci_gap_numeric_comparison_value_event_rp0 *)(blecore_evt->data))->Numeric_Value);
        APP_DBG_MSG(" Hex_value = %lx\n", ((aci_gap_numeric_comparison_value_event_rp0 *)(blecore_evt->data))->Numeric_Value);
        APP_DBG_MSG("ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE ==> GAP_PROC_NUMERIC_COMPARISON_VALUE_CONFIRM \n\r");
        GapProcReq(GAP_PROC_NUMERIC_COMPARISON_VALUE_CONFIRM);
          break;

       case (ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE):
          {
            pairing_complete = (aci_gap_pairing_complete_event_rp0*)blecore_evt->data;

            APP_DBG_MSG("ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE, Connection_Handle=0x%04X Status=%d Reason=0x%02x \n",pairing_complete->Connection_Handle,pairing_complete->Status,pairing_complete->Reason);
            if(pairing_complete->Status == SM_PAIRING_TIMEOUT){
              APP_DBG_MSG(" ** Pairing Timeout Status=%d Reason=0x%02x , \n\r !!! Please ignore this BLE Device on the iOS/Android Device Setting=>Bluetooth=>My Device or Paired Device !!! \n\r",pairing_complete->Status,pairing_complete->Reason);
              APP_BLE_Remove_Bonding_Info();
            }else if(pairing_complete->Status == SM_PAIRING_FAILED){
              APP_DBG_MSG(" ** Pairing KO Status=%d Reason=0x%02x , \n\r !!! Please ignore this BLE Device on the iOS/Android Device Setting=>Bluetooth=>My Device or Paired Device !!! \n\r",pairing_complete->Status,pairing_complete->Reason);
              APP_BLE_Remove_Bonding_Info();
            }else if(pairing_complete->Status == SM_PAIRING_SUCCESS){
              uint8_t Peer_Bonded,Security_Mode, Security_Level;
              Peer_Bonded = BleApplicationContext.Peer_Bonded;
              Security_Mode = BleApplicationContext.Security_Mode;
              Security_Level = BleApplicationContext.Security_Level;
        
              APP_BLE_Peer_Bonded_Check();
              APP_DBG_MSG("ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE  Peer_Bonded =%d => %d  Security_Mode=%d => %d Security_Level=%d => %d \n\r",
              Peer_Bonded,BleApplicationContext.Peer_Bonded,Security_Mode,BleApplicationContext.Security_Mode,Security_Level,BleApplicationContext.Security_Level);

              if (Peer_Bonded == 0x00)/* only for the first paring complete*/
              {
                APP_DBG_MSG("Term Connection for the first pairing complete to save bonding information !!! \n\r");

                for (int loop=0;loop<10;loop++) /* */
                {
                  /* hci_disconnection_complete_event event will be generated when the link is disconnected. 
                  It is important to leave an 100 ms blank window before sending any new command (including system hardware reset), 
                  since immediately after @ref hci_disconnection_complete_event event, system could save important information in non volatile memory. */
                  int cnt = 1000000;
                  while(cnt--);
                  printf(".\n\r");
                }

                ret = aci_gap_terminate(BleApplicationContext.connection_handle, 0x13);
                if (ret == BLE_STATUS_SUCCESS)
                {
                  Notification.Evt_Opcode = ANCS_DISCONNECTING;
                  ANCS_App_Notification(&Notification);
                }		 
              }
            } /* SM_PAIRING_SUCCESS */

	     if(BleApplicationContext.Security_Request == 0x01)
             gap_cmd_resp_release(0);

          }
           break; /* ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE */

        case ACI_GATT_PROC_COMPLETE_VSEVT_CODE:
        APP_DBG_MSG(" ** ACI_GATT_PROC_COMPLETE_VSEVT_CODE \n");
        /* USER CODE BEGIN ACI_GATT_PROC_COMPLETE_VSEVT_CODE */

        /* USER CODE END ACI_GATT_PROC_COMPLETE_VSEVT_CODE */
          break; /* ACI_GATT_PROC_COMPLETE_VSEVT_CODE */
      /* USER CODE END ecode */
        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
        APP_DBG_MSG("\r\n\r** ACI_GAP_PROC_COMPLETE_VSEVT_CODE \n");
        /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE */

        /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE */
          break; /* ACI_GAP_PROC_COMPLETE_VSEVT_CODE */

      /* USER CODE BEGIN BLUE_EVT */

      /* USER CODE END BLUE_EVT */
      }
      break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

      /* USER CODE BEGIN EVENT_PCKT */

      /* USER CODE END EVENT_PCKT */

      default:
      /* USER CODE BEGIN ECODE_DEFAULT*/

      /* USER CODE END ECODE_DEFAULT*/
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
    return BleApplicationContext.Device_Connection_Status;
}

/* USER CODE BEGIN FD*/
void APP_BLE_Key_Button1_Action(void)
{
  //ANCS_App_KeyButton1Action();
  APP_DBG_MSG("\n\r ** Term CONNECTION **  \n\r");
  aci_gap_terminate(BleApplicationContext.connection_handle, 0x13);
}

void APP_BLE_Key_Button2_Action(void)
{
  ANCS_App_KeyButton2Action();
}
  
void APP_BLE_Key_Button3_Action(void)
{
  //ANCS_App_KeyButton3Action();
  APP_DBG_MSG(" aci_gap_clear_security_db & aci_gap_remove_bonded_device & aci_gap_terminate \n\r");
  aci_gap_remove_bonded_device(BleApplicationContext.Peer_Address_Type,BleApplicationContext.Peer_Address);
  aci_gap_clear_security_db();
  aci_gap_terminate(BleApplicationContext.connection_handle, 0x13);
}

